Repository: Kbentham/bueditor
Catalog: translations/*.po
Languages: fr

source: Editor name
fr: Nom de l'éditeur

source: Operations
fr: Actions

source: Edit
fr: Editer

source: Delete
fr: Supprimer

source: Add new editor
fr: Ajouter un éditeur

source: Available editors
fr: Editeurs disponibles

source: user #1
fr: utilisateur # 1

source: n/a
fr: nd

source: Save configuration
fr: Enregistrer la configuration

source: User role
fr: Rôle de l'utilisateur

source: Assigned editor
fr: Editeur assigné

source: Alternative editor
fr: Editeur alternatif

source: Weight
fr: Poids

source: For users who have <strong>multiple roles</strong>, <strong>weight</strong> property will determine the assigned editor. Lighter roles that are placed upper will take the precedence. So, an administrator role should be placed over other roles by having a smaller weight, ie. -10.
fr: Pour les utilisateurs ayant <strong>plusieurs rôles</strong>, le<strong>poids</strong> détermine quel éditeur est attribué. Les rôles plus "légers" auront la préséance. Par conséquent, un rôle administrateur devrait être placé au-dessus des autres avec un poids de -10.

source: Role-editor assignments
fr: Attributions des éditeurs par rôle

source: Assign editors to user roles.
fr: Attribuer des éditeurs à des rôles

source: Alternative editor makes it possible to use different editors for different textareas or different editors on diffrent pages. You just have to configure visibility settings for each editor.
fr: Les éditeurs alternatifs permettent d'utiliser différents éditeurs en fonctions des zones de texte ou différents éditeurs en fonction des pages. Vous n'avez qu'a configurer les paramètres de visibilité de chaque éditeur.

source: Changes have been saved.
fr: Les modifications ont été enregistrées.

source: none
fr: aucun

source: Caption
fr: Légende

source: Show the editor on specific pages
fr: Afficher l'éditeur sur certaines pages

source: Enter one page per line as Drupal paths. The * character is a wildcard.
fr: Saisir une page par ligne avec des chemins Drupal. Le carractère * est un joker.

source: Hide the editor for specific textareas
fr: Cacher l'éditeur sur certaines pages

source: Enter one textarea ID per line. The * character is a wildcard.
fr: Saisir un ID de textarea par ligne. Le carractère * est un joker.

source: Directory of editor icons
fr: Annuaire d'icones de l'éditeur

source: Web accessible directory path where editor icons reside.
fr: Répertoir accessible par un chemin externe où les icones sont stockées.

source: Placeholders that you can use are; %BUEDITOR (bueditor path), %FILES (drupal files path), and %THEME (current theme's path).
fr: Les placeholders utilisables sont %BUEDITOR chemin de (bueditor), %FILES (chemin des fichiers Drupal) et %THEME (chemin du thème courant).

source: Directory of editor library
fr: Répertoire de la librairie de l'éditeur

source: Web accessible directory path where external javascript files reside.
fr: Répertoir accessible par un chemin externe où les fichiers JavaScript externes sont stockés.

source: New buttons are ready to be saved.
fr: Les nouveaux boutons sont prêts à être enregistrés.

source: There is no button to be imported.
fr: il n'y a pas de bouton à importer.

source: ... selecteds
fr: ... sélectionnés

source: Export
fr: Exporter

source: Go
fr: Allez

source: CSV file containing the buttons
fr: Fichier CSV contenant les boutons

source: Import
fr: Importer

source: Title
fr: Titre

source: Content
fr: Contenu

source: Icon
fr: Icône

source: Key
fr: Clé

source: new
fr: nouveau

source: Add new button
fr: Ajouter un bouton

source: To add a new button, you can either specify it at the bottom of the button list or import a CSV file which contains previously exported buttons. For more information about buttons and editor API please read !readme.
fr: Pour ajouter un nouveau bouton, vous pouvez soit le définir en bas de la liste de boutons, soit importerun fichier CSV contenant des boutons exportés auparavant. Pour plus d'informations a propos des boutons et de l'API de l'éditeur, lisez le !readme.

source: Visibility settings
fr: Paramètres de visibilité

source: Editor paths
fr: Chemins de l'éditeur

source: Import Buttons
fr: Importer les boutons

source: Demo
fr: Démo

source: Buttons
fr: Boutons

source: New editor has been added.
fr: Le nouvel éditeur a été ajouté.

source: Are you sure you want to delete the editor %name?
fr: Êtes-vous sûr de vouloir supprimer l'éditeur %name ?

source: All buttons and settings for this editor will be removed.
fr: Tous les boutons et paramètres de cet éditeur seront supprimés.

source: This action cannot be undone.
fr: Cette action ne peut pas être annulée.

source: Cancel
fr: Annuler

source: %name editor has been deleted.
fr: L'éditeur %name a été supprimé.

source: Selected buttons have been deleted.
fr: Les boutons sélectionnés ont été supprimés.

source: There is no button to export.
fr: Il n'y a pas de bouton à exporter.

source: Customize your text editor.
fr: Personnalise

source: Editor settings
fr: Paramètres de l'éditeur

source: Delete editor
fr: Supprimer l'éditeur

source: Stores editors and their settings.
fr: Stocke les éditeurs et leurs paramètres.

source: Primary Key: Unique editor ID.
fr: Clé primaire : ID unique de l'éditeur.

source: The editor name.
fr: Le nom de l'éditeur.

source: Drupal paths on which the editor is visible.
fr: Chemins Drupal dans lesquels l'éditeur est visible.

source: Textarea ids for which the editor is not visible.
fr: Ids des zones de texte où l'éditeur n'est pas visible.

source: The directory path where the editor icons reside.
fr: Le chemin du répertoire où les icones de l'éditeur sont stockées.

source: The directory path where the editor library files reside.
fr: Le chemin du répertoire où les fichiers de la librairie de l'éditeur sont stockés.

source: Stores buttons of {bueditor_editors}.
fr: Stocke les boutons de {bueditor_editors}.

source: Primary Key: Unique button ID.
fr: Clé primaire : ID unique du bouton.

source: The {bueditor_editors}.eid to which the button belongs.
fr: Le {bueditor_editors}.eid auquel les boutons appartiennent.

source: The button title.
fr: Le titre du bouton.

source: The button content.
fr: Le contenu du bouton.

source: The button icon or caption.
fr: L'icone du bouton ou sa légende.

source: The button acceskey.
fr: La clé d'accès (accesskey) du bouton.

source: The button weight that determines the button location in the editor layout.
fr: Le poids du bouton qui détermine la place du bouton dans la mise en page de l'éditeur.

source: A plain textarea editor aiming to facilitate code writing.
fr: Un éditeur de texte riche facilitant la saisie.

source: Send to @app
fr: Envoyer à @app
